## Terraform Plan — DEV Environment

| Step     | Result |
|----------|--------|
| Format   | ✅ `success` |
| Validate | ✅ `success` |
| Plan     | ✅ `success` |

<details><summary>📄 Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.data.aws_availability_zones.available: Reading...
module.bastion.data.aws_ami.ubuntu: Reading...
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Reading...
module.eks.aws_cloudwatch_log_group.eks_cluster_logs: Refreshing state... [id=/aws/eks/mlops-infr-dev-eks/cluster]
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-083559d82e7d1998e]
module.ecr.aws_ecr_repository.this["training"]: Refreshing state... [id=dev/kltn-project-dev-training]
module.ecr.aws_ecr_repository.this["serving"]: Refreshing state... [id=dev/kltn-project-dev-serving]
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Read complete after 0s [id=3552664922]
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Read complete after 0s [id=2851119427]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=mlops-infr-dev-eks-cluster-role]
module.eks.aws_iam_role.worker_nodes_role: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role]
module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260316141802814300000005]
module.eks.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260316141802781700000004]
module.eks.aws_iam_role_policy_attachment.worker_nodes_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260316141802748100000002]
module.eks.aws_iam_role_policy_attachment.worker_nodes_cni_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260316141802751800000003]
module.eks.aws_iam_role_policy_attachment.worker_nodes_registry_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260316141802710600000001]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=ap-southeast-1]
module.bastion.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c1d28734eb221b6d]
module.ecr.aws_ecr_lifecycle_policy.this["training"]: Refreshing state... [id=dev/kltn-project-dev-training]
module.ecr.aws_ecr_lifecycle_policy.this["serving"]: Refreshing state... [id=dev/kltn-project-dev-serving]
module.vpc.aws_subnet.public_subnet["1"]: Refreshing state... [id=subnet-0e44f690cf3cdf64b]
module.vpc.aws_subnet.public_subnet["0"]: Refreshing state... [id=subnet-0da7bc7d5691b65cd]
module.vpc.aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0a796dcdebc263547]
module.vpc.aws_subnet.private_subnet["0"]: Refreshing state... [id=subnet-0862ed7a1f256f78c]
module.vpc.aws_subnet.private_subnet["1"]: Refreshing state... [id=subnet-0c207ad36ff9b9f98]
module.security_group.aws_security_group.eks_control_plane: Refreshing state... [id=sg-08822865c37a74040]
module.bastion.aws_security_group.allow_ssh: Refreshing state... [id=sg-03bea05fbf2f9ce4a]
module.security_group.aws_security_group.eks_worker_nodes: Refreshing state... [id=sg-0ea37c431f2417bc5]
module.vpc.aws_eip.eip_nat["1"]: Refreshing state... [id=eipalloc-099b22b892bec040e]
module.vpc.aws_eip.eip_nat["0"]: Refreshing state... [id=eipalloc-05f68a7ba57a22e96]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-07748df0de9205335]
module.bastion.aws_instance.bastion_host["1"]: Refreshing state... [id=i-0c0e856b9785f2fa8]
module.bastion.aws_instance.bastion_host["0"]: Refreshing state... [id=i-0871801b469beb179]
module.eks.aws_eks_cluster.main: Refreshing state... [id=mlops-infr-dev-eks]
module.security_group.aws_security_group_rule.control_plane_to_nodes_https: Refreshing state... [id=sgrule-1857319367]
module.security_group.aws_security_group_rule.nodes_to_control_plane_https: Refreshing state... [id=sgrule-1625178756]
module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet: Refreshing state... [id=sgrule-516971348]
module.eks.aws_launch_template.eks_nodes: Refreshing state... [id=lt-0c0325a97a4054d26]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0de446a40e9d9e5b5]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0613193a100866aaa]
module.vpc.aws_nat_gateway.nat_gateway["0"]: Refreshing state... [id=nat-0582d7dacbdbb2d80]
module.vpc.aws_nat_gateway.nat_gateway["1"]: Refreshing state... [id=nat-07709b8607d432b24]
module.vpc.aws_route_table.private_route_table["1"]: Refreshing state... [id=rtb-08785455fa21ad6f5]
module.vpc.aws_route_table.private_route_table["0"]: Refreshing state... [id=rtb-01fff17651ecaa893]
module.eks.data.tls_certificate.eks: Reading...
module.eks.aws_eks_node_group.main: Refreshing state... [id=mlops-infr-dev-eks:mlops-infr-dev-eks-node-group]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-0c493e1a4a10a2825]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-03d0a552a1c0c8026]
module.eks.data.tls_certificate.eks: Read complete after 1s [id=e612b2443a55ee2c98467bff460cf41a1094cd46]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::255315173346:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/7D25982407507CAAE753D5E4D3C9D149]
module.load_balancer_controller.aws_iam_policy.aws_load_balancer_controller: Refreshing state... [id=arn:aws:iam::255315173346:policy/mlops-infr-dev-eks-aws-load-balancer-controller]
module.load_balancer_controller.data.aws_iam_policy_document.aws_load_balancer_controller_assume_role_policy: Reading...
module.load_balancer_controller.data.aws_iam_policy_document.aws_load_balancer_controller_assume_role_policy: Read complete after 0s [id=2861878062]
module.load_balancer_controller.aws_iam_role.aws_load_balancer_controller: Refreshing state... [id=mlops-infr-dev-eks-aws-load-balancer-controller]
module.load_balancer_controller.aws_iam_role_policy_attachment.aws_load_balancer_controller_attach: Refreshing state... [id=mlops-infr-dev-eks-aws-load-balancer-controller-20260316142925722500000013]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bastion.aws_iam_instance_profile.bastion_ssm will be created
  + resource "aws_iam_instance_profile" "bastion_ssm" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "KLTN-Bastion-Host-ssm-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "KLTN-Bastion-Host-ssm-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.bastion.aws_iam_role.bastion_ssm will be created
  + resource "aws_iam_role" "bastion_ssm" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "KLTN-Bastion-Host-ssm-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "KLTN-Bastion-Host-ssm-role"
        }
      + tags_all              = {
          + "Name" = "KLTN-Bastion-Host-ssm-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.bastion.aws_iam_role_policy_attachment.bastion_ssm will be created
  + resource "aws_iam_role_policy_attachment" "bastion_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "KLTN-Bastion-Host-ssm-role"
    }

  # module.security_group.aws_security_group_rule.control_plane_to_nodes_https will be created
  + resource "aws_security_group_rule" "control_plane_to_nodes_https" {
      + description              = "HTTPS from EKS control plane (webhook aggregation)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0ea37c431f2417bc5"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-08822865c37a74040"
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet will be created
  + resource "aws_security_group_rule" "control_plane_to_nodes_kubelet" {
      + description              = "Kubelet API - from EKS control plane"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0ea37c431f2417bc5"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-08822865c37a74040"
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.nodes_to_control_plane_https will be created
  + resource "aws_security_group_rule" "nodes_to_control_plane_https" {
      + description              = "Kubernetes API - HTTPS from worker nodes"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-08822865c37a74040"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0ea37c431f2417bc5"
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```
</details>

---
> ✅ **Plan OK.** To apply, run the workflow [Terraform Apply](../.github/workflows/terraform-apply.yml) with:
> - **Environment:** `dev`
> - **Plan Commit SHA:** `cf06f8a7671c4bf29b87e912bf92f3d1e10882f1`

> *Commit: `cf06f8a7671c4bf29b87e912bf92f3d1e10882f1`*